{"categories":[{"id":"cat-0","type":"category","title":"Debug","description":"Category for testing and debugging components","slug":"debug","url":"/categories/debug"}],"articles":[{"id":"art-0","type":"article","title":"MDX Components Testing","description":"Test all available MDX components and their features","sections":[{"h":"mdx-components-testing","t":"MDX Components Testing","c":"This article is designed to test all MDX components available in the blog system. It serves as a comprehensive reference for component rendering, styling, and functionality."},{"h":"code-blocks","t":"Code Blocks","c":"Testing the optimized Shiki syntax highlighter with dynamic language loading:"},{"h":"typography","t":"Typography","c":"Testing various heading levels and text formatting options."},{"h":"level-3-heading","t":"Level 3 Heading","c":"This is a paragraph under a level 3 heading. It demonstrates normal text flow and spacing."},{"h":"level-4-heading","t":"Level 4 Heading","c":"Even smaller headings maintain proper hierarchy and spacing. Level 5 Heading Testing deeper nesting levels. Level 6 Heading The smallest heading level available."},{"h":"text-formatting","t":"Text Formatting","c":"This is bold text and this is italic text. You can combine them for *bold italic text*. You can also use ~~strikethrough~~ for deleted or incorrect text. Use for variable names, function calls, or short code snippets within paragraphs."},{"h":"unordered-list","t":"Unordered List","c":"First item in the list Second item with bold text Third item with nested list: Nested item 1 Nested item 2 Deeply nested item Fourth item with"},{"h":"ordered-list","t":"Ordered List","c":"First step in the process Second step with emphasis Third step Fourth step with nested items: Sub-step A Sub-step B Sub-step C Final step"},{"h":"links","t":"Links","c":"Here's a standard link: Visit Example Links can also be used inline within text, like this link, to provide references without breaking the reading flow."},{"h":"blockquotes","t":"Blockquotes","c":"This is a blockquote. It can be used to highlight important information, quotes from other sources, or key takeaways. Blockquotes can span multiple paragraphs and maintain their distinctive styling throughout."},{"h":"horizontal-rule","t":"Horizontal Rule","c":"Use horizontal rules to separate sections: ---"},{"h":"inline-code-vs-code-blocks","t":"Inline Code vs Code Blocks","c":"Use for inline code snippets. For longer code examples, use fenced code blocks:"},{"h":"complex-code-example","t":"Complex Code Example","c":"Testing syntax highlighting with a more complex example:"},{"h":"mixed-content","t":"Mixed Content","c":"You can mix different elements together: A list item with bold text Another item with An item with a link And one with italic emphasis Note: This blockquote contains bold text and to demonstrate mixed formatting."},{"h":"conclusion","t":"Conclusion","c":"This article demonstrates all the major MDX components available in the blog system. Use it as a reference for component behavior and styling. The optimized Shiki highlighter with dynamic language loading ensures fast performance while maintaining beautiful syntax highlighting. --- Last updated: 2025-11-17"}],"category":"Debug","categorySlug":"debug","slug":"components","url":"/categories/debug/articles/components"}]}