{"categories":[{"id":"cat-0","type":"category","title":"Debug","description":"Categoria para testar e debugar componentes","slug":"debug","url":"/categorias/debug"}],"articles":[{"id":"art-0","type":"article","title":"Teste de Componentes MDX","description":"Teste todos os componentes MDX disponíveis e suas funcionalidades","sections":[{"h":"teste-de-componentes-mdx","t":"Teste de Componentes MDX","c":"Este artigo foi criado para testar todos os componentes MDX disponíveis no sistema do blog. Serve como uma referência abrangente para renderização, estilização e funcionalidade dos componentes."},{"h":"blocos-de-codigo","t":"Blocos de Código","c":"Testando o syntax highlighter Shiki otimizado com carregamento dinâmico de linguagens:"},{"h":"tipografia","t":"Tipografia","c":"Testando vários níveis de títulos e opções de formatação de texto."},{"h":"titulo-nivel-3","t":"Título Nível 3","c":"Este é um parágrafo sob um título de nível 3. Demonstra o fluxo normal do texto e espaçamento."},{"h":"titulo-nivel-4","t":"Título Nível 4","c":"Títulos ainda menores mantêm hierarquia e espaçamento adequados. Título Nível 5 Testando níveis de aninhamento mais profundos. Título Nível 6 O menor nível de título disponível."},{"h":"formatacao-de-texto","t":"Formatação de Texto","c":"Este é texto em negrito e este é texto em itálico. Você pode combiná-los para *texto em negrito e itálico*. Você também pode usar ~~texto tachado~~ para texto deletado ou incorreto. Use para nomes de variáveis, chamadas de função ou trechos curtos de código dentro de parágrafos."},{"h":"lista-nao-ordenada","t":"Lista Não Ordenada","c":"Primeiro item da lista Segundo item com texto em negrito Terceiro item com lista aninhada: Item aninhado 1 Item aninhado 2 Item profundamente aninhado Quarto item com"},{"h":"lista-ordenada","t":"Lista Ordenada","c":"Primeiro passo do processo Segundo passo com ênfase Terceiro passo Quarto passo com itens aninhados: Sub-passo A Sub-passo B Sub-passo C Passo final"},{"h":"links","t":"Links","c":"Aqui está um link padrão: Visite o Exemplo Links também podem ser usados inline dentro do texto, como este link, para fornecer referências sem quebrar o fluxo de leitura."},{"h":"citacoes-em-bloco","t":"Citações em Bloco","c":"Esta é uma citação em bloco. Pode ser usada para destacar informações importantes, citações de outras fontes ou pontos-chave. Citações em bloco podem se estender por vários parágrafos e manter sua estilização distintiva por todo o conteúdo."},{"h":"linha-horizontal","t":"Linha Horizontal","c":"Use linhas horizontais para separar seções: ---"},{"h":"codigo-inline-vs-blocos-de-codigo","t":"Código Inline vs Blocos de Código","c":"Use para trechos de código inline. Para exemplos de código mais longos, use blocos de código cercados:"},{"h":"exemplo-de-codigo-complexo","t":"Exemplo de Código Complexo","c":"Testando syntax highlighting com um exemplo mais complexo:"},{"h":"conteudo-misto","t":"Conteúdo Misto","c":"Você pode misturar diferentes elementos juntos: Um item de lista com texto em negrito Outro item com Um item com um link E um com ênfase em itálico Nota: Esta citação em bloco contém texto em negrito e para demonstrar formatação mista."},{"h":"conclusao","t":"Conclusão","c":"Este artigo demonstra todos os principais componentes MDX disponíveis no sistema do blog. Use-o como referência para comportamento e estilização de componentes. O highlighter Shiki otimizado com carregamento dinâmico de linguagens garante performance rápida enquanto mantém um belo syntax highlighting. --- Última atualização: 2025-11-17"}],"category":"Debug","categorySlug":"debug","slug":"components","url":"/categorias/debug/artigos/components"}]}